# варіант 3

class Calculator: # оголошення класу
    def add(self, a, b): # оголошення методу додавання
        return a + b # повернення результату додавання

    def sub(self, a, b): # оголошення методу віднімання
        return a - b # повернення результату віднімання

    def mul(self, a, b): # оголошення методу множення
        return a * b # повернення методу множення

    def div(self, a, b): # оголошення методу ділення
        if b == 0: # перевірка на нуль
            return "Помилка з діленням на 0"
        return a / b # повернення результату ділення

c = Calculator() # створюємо об'єкт типу калькулятора

# зчитування з консолі двох чисел
num1 = int(input("Введіть перше число: "))
num2 = int(input("Введіть друге число: "))


print(f"Додавання {c.add(num1, num2)}")
print(f"Віднімання {c.sub(num1, num2)}")
print(f"Множення {c.mul(num1, num2)}")
print(f"Ділення {c.div(num1, num2)}")